###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_security_group.kubernetes-security-group will be destroyed
  # (because aws_security_group.kubernetes-security-group is not in configuration)
  - resource "aws_security_group" "kubernetes-security-group" {
      - arn                    = "arn:aws:ec2:eu-west-3:377346518720:security-group/sg-03dae53a57b8cd293" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-03dae53a57b8cd293" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6443
            },
        ] -> null
      - name                   = "kubernetes-security-group" -> null
      - owner_id               = "377346518720" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
      - vpc_id                 = "vpc-05c566a68c1b1624b" -> null
    }

  # aws_subnet.private-mastodon will be created
  + resource "aws_subnet" "private-mastodon" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-private-3"
        }
      + tags_all                                       = {
          + "Env"  = "prd"
          + "Name" = "subnet-private-3"
        }
      + vpc_id                                         = "vpc-05c566a68c1b1624b"
    }

  # aws_subnet.public-mastodon will be created
  + resource "aws_subnet" "public-mastodon" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-public-4"
        }
      + tags_all                                       = {
          + "Env"  = "prd"
          + "Name" = "subnet-public-4"
        }
      + vpc_id                                         = "vpc-05c566a68c1b1624b"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `Terraform - Production`*